## What is pandas ?
#### In computer programming, pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series

In [1]:
# Import pandas library
import pandas as pd

### Series : Series differ from numpy as it access by label 
#### Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

In [2]:
import numpy as np
labels = ['A','B','C']
my_data = [10,20,30]
arr  = np.array(my_data)
d = {'A':10 , 'B':20 , 'C':30}
d

{'A': 10, 'B': 20, 'C': 30}

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data, index=labels)

A    10
B    20
C    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(arr,labels)

A    10
B    20
C    30
dtype: int32

In [7]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [8]:
ser1 = pd.Series([1,2,3,4],['USA','GERMANY','USSR','JAPAN'])
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [9]:
ser2 = pd.Series([1,2,7,8],['USA','GERMANY','FRANCE','JAPAN'])
ser2

USA        1
GERMANY    2
FRANCE     7
JAPAN      8
dtype: int64

In [10]:
ser1 + ser2

FRANCE      NaN
GERMANY     4.0
JAPAN      12.0
USA         2.0
USSR        NaN
dtype: float64

### DataFrame 
#### Is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.

In [11]:
from numpy.random import randn
np.random.seed(101)

In [12]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [13]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [15]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [16]:
df['new']= df['W'] + df['Y'] # will put a new column named new =W+Y

In [17]:
df.drop('new',axis=1,inplace=True) # axis =1 drop column

In [18]:
df.drop('E',axis = 0) # axis = 0 rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [19]:
df.shape # (5,4) rows = 5 columns=4 so axis=0 means rows and axis=1 means columns

(5, 4)

In [20]:
df.loc['C'] # select rows but for labels

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [21]:
df.iloc[2]  # select rows but for numerical

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [22]:
df.loc['B','Y']  #-0.8480

-0.8480769834036315

In [23]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

In [24]:
bool_df = df > 0 # return true and false

In [25]:
df[(df['W']>0) & (df['Y']>1)] # & means and

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df.reset_index() # to reset the df and numerical numbers with labels 
#without it their will be no numerical values

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [27]:
newind = 'CA NY WY OR CO'.split #.split to split blank space
newind

In [28]:
df['States'] = newind
df.set_index('States')

,W,X,Y,Z
States,,,,
<built-in method split of str object at 0x00000277562CAF30>,2.706850,0.628133,0.907969,0.503826
<built-in method split of str object at 0x00000277562CAF30>,0.651118,-0.319318,-0.848077,0.605965
<built-in method split of str object at 0x00000277562CAF30>,-2.018168,0.740122,0.528813,-0.589001
<built-in method split of str object at 0x00000277562CAF30>,0.188695,-0.758872,-0.933237,0.955057
<built-in method split of str object at 0x00000277562CAF30>,0.190794,1.978757,2.605967,0.683509

In [29]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) #//zip method combine the 2 lists into tuple pairs
# [(G1,1),(G1,2),(G1,3),(G2,1)...]

In [30]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [31]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [32]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [33]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [34]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [35]:
df.index.names = ['Groups','Nums']
df

                    A         B
Groups Nums
G1     1     0.302665  1.693723
       2    -1.706086 -1.159119
       3    -0.134841  0.390528
G2     1     0.166905  0.184502
       2     0.807706  0.072960
       3     0.638787  0.329646

In [36]:
df.loc['G1']

             A         B
Nums
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [37]:
df.loc['G1'].loc[3]['B']

0.39052784273374097

In [38]:
df.xs('G1')

             A         B
Nums
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [39]:
df.xs(1,level='Nums')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## Missing Values

In [40]:
d = {'A':[np.nan,5,np.nan],'B':[np.nan,10,4],'C':[1,3,5]}
d

{'A': [nan, 5, nan], 'B': [nan, 10, 4], 'C': [1, 3, 5]}

In [41]:
df = pd.DataFrame(d)
df

     A     B  C
0  NaN   NaN  1
1  5.0  10.0  3
2  NaN   4.0  5

In [42]:
df.dropna()

     A     B  C
1  5.0  10.0  3

In [43]:
df.dropna(axis=1)

   C
0  1
1  3
2  5

In [44]:
df.dropna(thresh=2)

     A     B  C
1  5.0  10.0  3
2  NaN   4.0  5

In [45]:
df.fillna('fillthem')

          A         B  C
0  fillthem  fillthem  1
1         5        10  3
2  fillthem         4  5

In [46]:
df['A'].fillna(value=df['A'].mean())

0    5.0
1    5.0
2    5.0
Name: A, dtype: float64

In [47]:
df['B'].fillna(value=df['B'].mean())

0     7.0
1    10.0
2     4.0
Name: B, dtype: float64

## Group by

In [48]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Sam','Charlie','Amy','Vanesaa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}

In [49]:
df = pd.DataFrame(data)

In [50]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanesaa    124
4      FB     Carl    243
5      FB    Sarah    350

In [51]:
bycomp = df.groupby('Company')

In [52]:
bycomp

In [53]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [54]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [55]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [56]:
# in one line
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [57]:
bycomp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanesaa    340

In [58]:
bycomp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [59]:
bycomp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [60]:
bycomp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [61]:
bycomp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### Merging, Joining and Concatenating
### Concatenate

In [62]:
df1 =pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']},index=[0,1,2,3])
df2 =pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7'],'D':['D4','D5','D6','D7']},index=[4,5,6,7])
df3 =pd.DataFrame({'A':['A8','A9','A10','A11'],'B':['B8','B9','B10','B11'],'C':['C8','C9','C10','C11'],'D':['D8','D9','D10','D11']},index=[8,9,10,11])

In [63]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [64]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [65]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [66]:
pd.concat([df1,df2,df3]) # Concatenate rows (axis=0 by default)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [67]:
pd.concat([df1,df2,df3],axis=1) # Concatenate Columns

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Merge

In [68]:
Left =pd.DataFrame({'Key':['K0','K1','K2','K3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3']})
Right =pd.DataFrame({'Key':['K0','K1','K2','K3'],'D':['D4','D5','D6','D7'],'E':['E4','E5','E6','E7']})

In [69]:
Left

  Key   B   C
0  K0  B0  C0
1  K1  B1  C1
2  K2  B2  C2
3  K3  B3  C3

In [70]:
Right

  Key   D   E
0  K0  D4  E4
1  K1  D5  E5
2  K2  D6  E6
3  K3  D7  E7

In [71]:
pd.merge(Left,Right,how='inner',on='Key')

  Key   B   C   D   E
0  K0  B0  C0  D4  E4
1  K1  B1  C1  D5  E5
2  K2  B2  C2  D6  E6
3  K3  B3  C3  D7  E7

## Joining

In [72]:
df1 =pd.DataFrame({'A':['A0','A1','A2'],'B':['B0','B1','B2']},index=['K0','K1','K2'])
df2 =pd.DataFrame({'C':['C0','C2','C3'],'D':['D0','D2','D3']},index=['K0','K2','K3'])

In [73]:
df1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [74]:
df2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [75]:
df1.join(df2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [76]:
df1.join(df2,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations

In [77]:
df = pd.DataFrame({'Col1':[1,2,3,4],'Col2':[444,223,323,444],'Col3':['abc','def','ghi','xyz']})

In [78]:
df

   Col1  Col2 Col3
0     1   444  abc
1     2   223  def
2     3   323  ghi
3     4   444  xyz

In [79]:
# To get ALL the unique values
df['Col2'].unique()

array([444, 223, 323], dtype=int64)

In [80]:
# To get the lenght of aLL unique values
df['Col2'].nunique()

3

In [81]:
df['Col2'].value_counts()

444    2
223    1
323    1
Name: Col2, dtype: int64

In [82]:
# Selection 
df[(df['Col1']>2) & (df['Col2']== 444)]

   Col1  Col2 Col3
3     4   444  xyz

In [83]:
def times2(x):
    return x*2

In [84]:
# apply method
df['Col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: Col1, dtype: int64

In [85]:
df['Col2'].apply(lambda x: x*2)

0    888
1    446
2    646
3    888
Name: Col2, dtype: int64

In [86]:
df.columns

Index(['Col1', 'Col2', 'Col3'], dtype='object')

In [87]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [88]:
df.sort_values('Col2')

   Col1  Col2 Col3
1     2   223  def
2     3   323  ghi
0     1   444  abc
3     4   444  xyz

In [89]:
df.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [90]:
df.isnull().sum()

Col1    0
Col2    0
Col3    0
dtype: int64

## Data input and output
#### CSV, EXCEL, HTML, SQL

In [91]:
# you need to install all of these libraries 
#conda install html5lib
# conda install lxml
# conda install sqlalchemy
# conda install BeautifulSoup4

In [92]:
pwd

'D:\\'

In [97]:
# to read a csv file
# pd.read_csv('path for your csv file')

In [98]:
# to save a csv file
# df.to_csv('Any Name')

In [99]:
# to read an excel file
# pd.read_excel('Excel file path',sheetname ='sheet name')

In [100]:
# to save an excel file
# df.to_excel('new excel file',sheetname = 'new sheet')

In [101]:
# to read an html 
# pd.read_html('Link of the website data you want')

In [114]:
from sqlalchemy import create_engine

In [115]:
engine = create_engine('sqlite:///:memory:')

In [117]:
# to save an sql file
df.to_sql('new sql',engine)

In [118]:
sqldf = pd.read_sql('new sql',con = engine)

In [119]:
sqldf

   index  Col1  Col2 Col3
0      0     1   444  abc
1      1     2   223  def
2      2     3   323  ghi
3      3     4   444  xyz